def forward_inference(rules, facts):
    inferred_facts = set() #Khởi tạo một tập hợp rỗng để lưu trữ các sự kiện đã suy luận được.
    new_facts_added = True #Đặt cờ new_facts_added thành True để bắt đầu vòng lặp.

    while new_facts_added: #Bắt đầu vòng lặp, vòng lặp này sẽ chạy cho đến khi không còn sự kiện mới được thêm vào inferred_facts.
        new_facts_added = False #Đặt cờ new_facts_added thành False để kiểm tra xem có sự kiện mới được thêm vào inferred_facts không.

        for rule in rules:
            premises, conclusions = rule
            #Gán giả thiết và kết luận của luật hiện tại vào các biến premises và conclusions.
            if all(premise in facts or premise in inferred_facts for premise in premises):
                #Kiểm tra xem tất cả các giả thiết của luật hiện tại có trong tập sự kiện đã biết (facts) hoặc
                # trong tập sự kiện đã suy luận (inferred_facts) hay không.
                for conclusion in conclusions:
                    if conclusion not in facts and conclusion not in inferred_facts:
                        inferred_facts.add(conclusion)
                        #Thêm kết luận hiện tại vào tập hợp các sự kiện đã suy luận (inferred_facts).
                        new_facts_added = True
                        #Đặt cờ new_facts_added thành True để chỉ ra rằng có sự kiện mới được thêm vào inferred_facts.
    return inferred_facts

#Tập luật cho suy diễn phần đầu
rule1 = [
    ({"S29", "S23"}, {"D1", "D2", "D3", "D4", "D5", "D6", "D7"}),
    ({"S29", "S21"}, {"D8"}),
    ({"S29", "S22"}, {"D9", "D10", "D11", "D12", "D13"}),
    ({"S30", "S23"}, {"D14", "D15", "D17"}),
    ({"S30", "S25"}, {"D16"}),
    ({"S30", "S22"}, {"D18", "D19", "D20", "D22"}),
    ({"S30", "S26"}, {"D21"}),
    ({"S31", "S21"}, {"D23", "D24", "D25", "D27", "D28"}),
    ({"S31", "S22"}, {"D26"}),
    ({"S32", "S24"}, {"D29", "D30", "D31", "D32", "D33", "D34", "D35"}),
    ({"S33", "S25"}, {"D36", "D37", "D38", "D41"}),
    ({"S33", "S23"}, {"D39", "D40"}),
    ({"S34", "S27"}, {"D42", "D43", "D44", "D45"})
]
#Tập luật cho suy diễn phần sau
rule2 = [
    ({"S21", "S16"}, {"D8", "D23", "D24", "D25", "D27", "D28"}),
    ({"S21", "S19"}, {"D8", "D23", "D24", "D25", "D27", "D28"}),
    ({"S21", "S20", "S28"}, {"D8", "D23", "D24", "D25", "D27", "D28"}),
    ({"S21", "S17", "S9", "S3"}, {"D8"}),
    ({"S21", "S17", "S10", "S3"}, {"D8"}),
    ({"S21", "S17", "S10", "S4"}, {"D23"}),
    ({"S21", "S17", "S10", "S5"}, {"D27"}),
    ({"S21", "S17", "S10", "S1"}, {"D28"}),
    ({"S21", "S17", "S13", "S3"}, {"D8", "D24", "D28"}),
    ({"S21", "S17", "S13", "S4"}, {"D25"}),
    ({"S21", "S17", "S13", "S5"}, {"D27"}),
    ({"S21", "S17", "S12", "S8"}, {"D23", "D27"}),
    ({"S21", "S17", "S12", "S6"}, {"D24"}),
    ({"S21", "S17", "S12", "S7"}, {"D25"}),
    ({"S21", "S17", "S12", "S6"}, {"D28"}),
    ({"S22", "S16"}, {"D9", "D10", "D11", "D12", "D13", "D18", "D19", "D20", "D22", "D26"}),
    ({"S22", "S19"}, {"D9", "D10", "D11", "D12", "D13", "D18", "D19", "D20", "D22", "D26"}),
    ({"S22", "S20", "S28"}, {"D9", "D10", "D11", "D12", "D13", "D22", "D26"}),
    ({"S22", "S17", "S9", "S4"}, {"D9", "D12", "D13", "D19", "D20"}),
    ({"S22", "S17", "S9", "S5"}, {"D10", "D11"}),
    ({"S22", "S17", "S9", "S3"}, {"D18"}),
    ({"S22", "S17", "S10", "S4"}, {"D9", "D12", "D13", "D19", "D20"}),
    ({"S22", "S17", "S10", "S5"}, {"D10", "D11"}),
    ({"S22", "S17", "S10", "S3"}, {"D18", "D22", "D26"}),
    ({"S22", "S17", "S13", "S4"}, {"D9", "D12", "D13", "D19", "D20", "D26"}),
    ({"S22", "S17", "S13", "S5"}, {"D10", "D11"}),
    ({"S22", "S17", "S13", "S3"}, {"D18", "D22"}),
    ({"S22", "S17", "S15", "S3"}, {"D22"}),
    ({"S23", "S16"}, {"D1", "D2", "D3", "D4", "D5", "D6", "D7", "D14", "D15", "D17", "D39", "D40"}),({ "S23", "S19" }, { "D1", "D2", "D3", "D4", "D5", "D6", "D7", "D14", "D15", "D17", "D39", "D40" }),
    ({ "S23", "S20", "S28" }, { "D1", "D2", "D3", "D4", "D5", "D6", "D7", "D15", "D39", "D40" }),
    ({ "S23", "S17", "S9", "S4" }, { "D1", "D2", "D15" }),
    ({ "S23", "S17", "S9", "S6" }, { "D3" }),
    ({ "S23", "S17", "S9", "S5" }, { "D4", "D5", "D6", "D7" }),
    ({ "S23", "S17", "S9", "S2" }, { "D14", "D17" }),
    ({ "S23", "S17", "S10", "S4" }, { "D1", "D2", "D15" }),
    ({ "S23", "S17", "S10", "S6" }, { "D3" }),
    ({ "S23", "S17", "S10", "S5" }, { "D4", "D5", "D6", "D7" }),
    ({ "S23", "S17", "S10", "S2" }, { "D14" }),
    ({ "S23", "S17", "S13", "S5" }, { "D7" }),
    ({ "S23", "S17", "S13", "S4" }, { "D15" }),
    ({ "S23", "S17", "S15", "S2" }, { "D17" }),
    ({ "S23", "S17", "S11", "S2" }, { "D17" }),
    ({ "S23", "S17", "S11", "S4" }, { "D39" }),
    ({ "S23", "S17", "S11", "S3" }, { "D40" }),
    ({ "S24", "S16" }, { "D29", "D30", "D31", "D32", "D33", "D34", "D35" }),
    ({ "S24", "S19" }, { "D29", "D30", "D31", "D32", "D33", "D34", "D35" }),
    ({ "S24", "S20", "S28" }, { "D29", "D32", "D35" }),
    ({ "S24", "S17", "S9", "S5" }, { "D29" }),
    ({ "S24", "S17", "S9", "S4" }, { "D30", "D33" }),
    ({ "S24", "S17", "S9", "S2" }, { "D35" }),
    ({ "S24", "S17", "S13", "S6" }, { "D29", "D32" }),
    ({ "S24", "S17", "S13", "S4" }, { "D31" }),
    ({ "S24", "S17", "S13", "S2" }, { "D35" }),
    ({ "S24", "S17", "S10", "S4" }, { "D30", "D35" }),
    ({ "S24", "S17", "S11", "S5" }, { "D33" }),
    ({ "S24", "S17", "S12", "S7" }, { "D31", "D34" }),
    ({ "S25", "S16" }, { "D16", "D36", "D37", "D38", "D41" }),
    ({ "S25", "S19" }, { "D16", "D36", "D37", "D38", "D41" }),
    ({ "S25", "S20", "S28" }, { "D36", "D37", "D38", "D41" }),
    ({ "S25", "S17", "S9", "S2" }, { "D16" }),
    ({ "S25", "S17", "S10", "S2" }, { "D16" }),
    ({ "S25", "S17", "S13", "S2" }, { "D16" }),
    ({ "S25", "S17", "S11", "S6" }, { "D36" }),
    ({ "S25", "S17", "S11", "S4" }, { "D37" }),
    ({ "S25", "S17", "S11", "S5" }, { "D38" }),
    ({ "S25", "S17", "S11", "S3" }, { "D41" }),
    ({ "S26", "S16" }, { "D21" }),
    ({ "S26", "S19" }, { "D21" }),
    ({ "S26", "S20", "S28" }, { "D21" }),
    ({ "S26", "S17", "S13", "S2" }, { "D21" }),
    ({ "S27", "S18" }, { "D42", "D43", "D44", "D45" }),
    ({ "S8" }, { "S7", "S6", "S5", "S4", "S3", "S2", "S1" }),
    ({ "S7" }, { "S6", "S5", "S4", "S3", "S2", "S1" }),
    ({ "S6" }, { "S5", "S4", "S3", "S2", "S1" }),
    ({ "S5" }, { "S4", "S3", "S2", "S1" }),
    ({ "S4" }, { "S3", "S2", "S1" }),
    ({ "S3" }, { "S2", "S1" }),
    ({ "S2" }, { "S1" })

]
